GENDER_CHOICES = (
    ('M', 'Male'),
    ('F', 'Female'),
)
PLACE_CHOICES = (
    ('01', '上海市'),
    ('02', '北京市'),
    ('03', '山东省'),
    ('04', '黑龙江省'),
    ('05', '吉林省'),
    ('06', '辽宁省'),
    ('07', '河北省'),
    ('08', '内蒙古自治区'),
    ('09', '天津市'),
    ('10', '山西省'),
    ('11', '陕西省'),
    ('12', '甘肃省'),
    ('13', '新疆维吾尔自治区'),
    ('14', '青海省'),
    ('15', '河南省'),
    ('16', '宁夏回族自治区'),
    ('17', '西藏自治区'),
    ('18', '四川省'),
    ('19', '湖北省'),
    ('20', '湖南省'),
    ('21', '江苏省'),
    ('22', '浙江省'),
    ('23', '安徽省'),
    ('24', '福建省'),
    ('25', '云南省'),
    ('26', '贵州省'),
    ('27', '广东省'),
    ('28', '广西壮族自治区'),
    ('29', '重庆市'),
    ('30', '海南省'),
    ('31', '江西省'),
    ('32', '境外')
)
visa_choices = (
    ('A', '一次入境签证'),
    ('B', '多次入境签证'),
)
duty_choices = (
        ('A', '所长'),
        ('B', '副所长'),
        ('C', '书记'),
        ('D', '无'),
)
identity_choices = (
        ('A', '研究员'),
        ('B', '副研究员'),
        ('C', '助理研究员'),
        ('D', '工程师'),
        ('E', '高级工程师'),
        ('F', '正高级工程师'),
        ('G', '博士后、在读学生'),
)
race_choices = (
        ('01', '汉族'),
        ('02', '满族'),
        ('03', '回族'),
        ('04', '藏族'),
        ('05', '壮族'),
        ('06', '其他'),
)
political_choices = (
        ('01', '中共党员'),
        ('02', '中共预备党员'),
        ('03', '共青团员'),
        ('04', '民革党员'),
        ('05', '民盟盟员'),
        ('06', '民建会员'),
        ('07', '民进会员'),
        ('08', '农工党党员'),
        ('09', '致公党党员'),
        ('10', '九三学社社员'),
        ('11', '台盟盟员'),
        ('12', '无党派人士'),
        ('13', '群众'),
)
securety_choices = (
        ('A', '绝密'),
        ('B', '机密'),
        ('C', '秘密'),
        ('D', '不涉密'),
)
health_choices = (
        ('A', '健康'),
        ('B', '一般'),
        ('C', '较差'),
)
delegation_choices = (
        ('A', '教学科研类团组'),
        ('B', '非教学科研类团组'),
)

delegation_tag_choices = (
        ('01', '合作研究'),
        ('02', '学术访问'),
        ('03', '出席国际会议'),
        ('04', '教学活动'),
        ('05', '科学观测'),
        ('06', '科学考察'),
        ('07', '科研仪器调试'),
        ('08', '科技展览'),
        ('09', '出席国际组织活动'),
        ('10', '人才招聘'),
        ('11', '其他'),
)


cash_choices=(
    (1, '美元'),
    (2, '欧元'),
    (3, '英镑'),
    (4, '日元'),
)