GENDER_CHOICES = (
    ('M', 'Male'),
    ('F', 'Female'),
)
PLACE_CHOICES = (
    ('SH', '上海市'),
    ('BJ', '北京市'),
    ('SD', '山东省'),
    ('HL', '黑龙江省'),
    ('JL', '吉林省'),
    ('LN', '辽宁省'),
    ('HB', '河北省'),
    ('NM', '内蒙古自治区'),
    ('TJ', '天津市'),
    ('SX', '山西省'),
    ('SH', '陕西省'),
    ('GS', '甘肃省'),
    ('XJ', '新疆维吾尔自治区'),
    ('QH', '青海省'),
    ('HE', '河南省'),
    ('NX', '宁夏回族自治区'),
    ('XZ', '西藏自治区'),
    ('SC', '四川省'),
    ('BH', '湖北省'),
    ('HU', '湖南省'),
    ('JS', '江苏省'),
    ('ZJ', '浙江省'),
    ('AH', '安徽省'),
    ('FJ', '福建省'),
    ('YN', '云南省'),
    ('GZ', '贵州省'),
    ('GD', '广东省'),
    ('GX', '广西壮族自治区'),
    ('CQ', '重庆市'),
    ('HA', '海南省'),
    ('JX', '江西省'),
    ('JW', '境外')
)
visa_choices = (
    ('A', '一次入境签证'),
    ('B', '多次入境签证'),
)
duty_choices = (
        ('A', '所长'),
        ('B', '副所长'),
        ('C', '书记'),
        ('D', '无'),
)
identity_choices = (
        ('A', '研究员'),
        ('B', '副研究员'),
        ('C', '助理研究员'),
        ('D', '工程师'),
        ('E', '高级工程师'),
        ('F', '正高级工程师'),
        ('G', '博士后、在读学生'),
)
race_choices = (
        ('01', '汉族'),
        ('02', '满族'),
        ('03', '回族'),
        ('04', '藏族'),
        ('05', '壮族'),
        ('06', '其他'),
)
political_choices = (
        ('01', '中共党员'),
        ('02', '中共预备党员'),
        ('03', '共青团员'),
        ('04', '民革党员'),
        ('05', '民盟盟员'),
        ('06', '民建会员'),
        ('07', '民进会员'),
        ('08', '农工党党员'),
        ('09', '致公党党员'),
        ('10', '九三学社社员'),
        ('11', '台盟盟员'),
        ('12', '无党派人士'),
        ('13', '群众'),
)
securety_choices = (
        ('A', '绝密'),
        ('B', '机密'),
        ('C', '秘密'),
        ('D', '不涉密'),
)
health_choices = (
        ('A', '健康'),
        ('B', '一般'),
        ('C', '较差'),
)